Ac6Embedded/svd-microchip/PIC32CZ_CA70/PIC32CZ5125CA70144.svd
               <register>
                  <name>CMR_WAVEFORM_MODE</name>
                  <description>Channel Mode Register (channel = 0)</description>
                  <alternateRegister>CMR_CAPTURE_MODE</alternateRegister>
                  <addressOffset>0x04</addressOffset>
                  <fields>
                     <field>
                        <name>TCCLKS</name>
                        <description>Clock Selection</description>
                        <bitOffset>0</bitOffset>
                        <bitWidth>3</bitWidth>
                        <writeConstraint>
                           <useEnumeratedValues>true</useEnumeratedValues>
                        </writeConstraint>
                        <enumeratedValues>
                           <name>TCCLKSSelect</name>
                           <enumeratedValue>
                              <name>TIMER_CLOCK1</name>
                              <description>Clock selected: internal PCK6 clock signal (from PMC)</description>
                              <value>0x0</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>TIMER_CLOCK2</name>
                              <description>Clock selected: internal MCK/8 clock signal (from PMC)</description>
                              <value>0x1</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>TIMER_CLOCK3</name>
                              <description>Clock selected: internal MCK/32 clock signal (from PMC)</description>
                              <value>0x2</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>TIMER_CLOCK4</name>
                              <description>Clock selected: internal MCK/128 clock signal (from PMC)</description>
                              <value>0x3</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>TIMER_CLOCK5</name>
                              <description>Clock selected: internal SLCK clock signal (from PMC)</description>
                              <value>0x4</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>XC0</name>
                              <description>Clock selected: XC0</description>
                              <value>0x5</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>XC1</name>
                              <description>Clock selected: XC1</description>
                              <value>0x6</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>XC2</name>
                              <description>Clock selected: XC2</description>
                              <value>0x7</value>
                           </enumeratedValue>
                        </enumeratedValues>
                     </field>
                     <field>
                        <name>CLKI</name>
                        <description>Clock Invert</description>
                        <bitOffset>3</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>BURST</name>
                        <description>Burst Signal Selection</description>
                        <bitOffset>4</bitOffset>
                        <bitWidth>2</bitWidth>
                        <writeConstraint>
                           <useEnumeratedValues>true</useEnumeratedValues>
                        </writeConstraint>
                        <enumeratedValues>
                           <name>BURSTSelect</name>
                           <enumeratedValue>
                              <name>NONE</name>
                              <description>The clock is not gated by an external signal.</description>
                              <value>0x0</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>XC0</name>
                              <description>XC0 is ANDed with the selected clock.</description>
                              <value>0x1</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>XC1</name>
                              <description>XC1 is ANDed with the selected clock.</description>
                              <value>0x2</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>XC2</name>
                              <description>XC2 is ANDed with the selected clock.</description>
                              <value>0x3</value>
                           </enumeratedValue>
                        </enumeratedValues>
                     </field>
                     <field>
                        <name>CPCSTOP</name>
                        <description>Counter Clock Stopped with RC Compare</description>
                        <bitOffset>6</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>CPCDIS</name>
                        <description>Counter Clock Disable with RC Loading</description>
                        <bitOffset>7</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>EEVTEDG</name>
                        <description>External Event Edge Selection</description>
                        <bitOffset>8</bitOffset>
                        <bitWidth>2</bitWidth>
                        <writeConstraint>
                           <useEnumeratedValues>true</useEnumeratedValues>
                        </writeConstraint>
                        <enumeratedValues>
                           <name>EEVTEDGSelect</name>
                           <enumeratedValue>
                              <name>NONE</name>
                              <description>None</description>
                              <value>0x0</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>RISING</name>
                              <description>Rising edge</description>
                              <value>0x1</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>FALLING</name>
                              <description>Falling edge</description>
                              <value>0x2</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>EDGE</name>
                              <description>Each edges</description>
                              <value>0x3</value>
                           </enumeratedValue>
                        </enumeratedValues>
                     </field>
                     <field>
                        <name>EEVT</name>
                        <description>External Event Selection</description>
                        <bitOffset>10</bitOffset>
                        <bitWidth>2</bitWidth>
                        <writeConstraint>
                           <useEnumeratedValues>true</useEnumeratedValues>
                        </writeConstraint>
                        <enumeratedValues>
                           <name>EEVTSelect</name>
                           <enumeratedValue>
                              <name>TIOB</name>
                              <description>TIOB</description>
                              <value>0x0</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>XC0</name>
                              <description>XC0</description>
                              <value>0x1</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>XC1</name>
                              <description>XC1</description>
                              <value>0x2</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>XC2</name>
                              <description>XC2</description>
                              <value>0x3</value>
                           </enumeratedValue>
                        </enumeratedValues>
                     </field>
                     <field>
                        <name>ENETRG</name>
                        <description>External Event Trigger Enable</description>
                        <bitOffset>12</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>WAVSEL</name>
                        <description>Waveform Selection</description>
                        <bitOffset>13</bitOffset>
                        <bitWidth>2</bitWidth>
                        <writeConstraint>
                           <useEnumeratedValues>true</useEnumeratedValues>
                        </writeConstraint>
                        <enumeratedValues>
                           <name>WAVSELSelect</name>
                           <enumeratedValue>
                              <name>UP</name>
                              <description>UP mode without automatic trigger on RC Compare</description>
                              <value>0x0</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>UPDOWN</name>
                              <description>UPDOWN mode without automatic trigger on RC Compare</description>
                              <value>0x1</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>UP_RC</name>
                              <description>UP mode with automatic trigger on RC Compare</description>
                              <value>0x2</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>UPDOWN_RC</name>
                              <description>UPDOWN mode with automatic trigger on RC Compare</description>
                              <value>0x3</value>
                           </enumeratedValue>
                        </enumeratedValues>
                     </field>
                     <field>
                        <name>WAVE</name>
                        <description>Waveform Mode</description>
                        <bitOffset>15</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>ACPA</name>
                        <description>RA Compare Effect on TIOAx</description>
                        <bitOffset>16</bitOffset>
                        <bitWidth>2</bitWidth>
                        <writeConstraint>
                           <useEnumeratedValues>true</useEnumeratedValues>
                        </writeConstraint>
                        <enumeratedValues>
                           <name>ACPASelect</name>
                           <enumeratedValue>
                              <name>NONE</name>
                              <description>NONE</description>
                              <value>0x0</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>SET</name>
                              <description>SET</description>
                              <value>0x1</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>CLEAR</name>
                              <description>CLEAR</description>
                              <value>0x2</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>TOGGLE</name>
                              <description>TOGGLE</description>
                              <value>0x3</value>
                           </enumeratedValue>
                        </enumeratedValues>
                     </field>
                     <field>
                        <name>ACPC</name>
                        <description>RC Compare Effect on TIOAx</description>
                        <bitOffset>18</bitOffset>
                        <bitWidth>2</bitWidth>
                        <writeConstraint>
                           <useEnumeratedValues>true</useEnumeratedValues>
                        </writeConstraint>
                        <enumeratedValues>
                           <name>ACPCSelect</name>
                           <enumeratedValue>
                              <name>NONE</name>
                              <description>NONE</description>
                              <value>0x0</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>SET</name>
                              <description>SET</description>
                              <value>0x1</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>CLEAR</name>
                              <description>CLEAR</description>
                              <value>0x2</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>TOGGLE</name>
                              <description>TOGGLE</description>
                              <value>0x3</value>
                           </enumeratedValue>
                        </enumeratedValues>
                     </field>
                     <field>
                        <name>AEEVT</name>
                        <description>External Event Effect on TIOAx</description>
                        <bitOffset>20</bitOffset>
                        <bitWidth>2</bitWidth>
                        <writeConstraint>
                           <useEnumeratedValues>true</useEnumeratedValues>
                        </writeConstraint>
                        <enumeratedValues>
                           <name>AEEVTSelect</name>
                           <enumeratedValue>
                              <name>NONE</name>
                              <description>NONE</description>
                              <value>0x0</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>SET</name>
                              <description>SET</description>
                              <value>0x1</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>CLEAR</name>
                              <description>CLEAR</description>
                              <value>0x2</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>TOGGLE</name>
                              <description>TOGGLE</description>
                              <value>0x3</value>
                           </enumeratedValue>
                        </enumeratedValues>
                     </field>
                     <field>
                        <name>ASWTRG</name>
                        <description>Software Trigger Effect on TIOAx</description>
                        <bitOffset>22</bitOffset>
                        <bitWidth>2</bitWidth>
                        <writeConstraint>
                           <useEnumeratedValues>true</useEnumeratedValues>
                        </writeConstraint>
                        <enumeratedValues>
                           <name>ASWTRGSelect</name>
                           <enumeratedValue>
                              <name>NONE</name>
                              <description>NONE</description>
                              <value>0x0</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>SET</name>
                              <description>SET</description>
                              <value>0x1</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>CLEAR</name>
                              <description>CLEAR</description>
                              <value>0x2</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>TOGGLE</name>
                              <description>TOGGLE</description>
                              <value>0x3</value>
                           </enumeratedValue>
                        </enumeratedValues>
                     </field>
                     <field>
                        <name>BCPB</name>
                        <description>RB Compare Effect on TIOBx</description>
                        <bitOffset>24</bitOffset>
                        <bitWidth>2</bitWidth>
                        <writeConstraint>
                           <useEnumeratedValues>true</useEnumeratedValues>
                        </writeConstraint>
                        <enumeratedValues>
                           <name>BCPBSelect</name>
                           <enumeratedValue>
                              <name>NONE</name>
                              <description>NONE</description>
                              <value>0x0</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>SET</name>
                              <description>SET</description>
                              <value>0x1</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>CLEAR</name>
                              <description>CLEAR</description>
                              <value>0x2</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>TOGGLE</name>
                              <description>TOGGLE</description>
                              <value>0x3</value>
                           </enumeratedValue>
                        </enumeratedValues>
                     </field>
                     <field>
                        <name>BCPC</name>
                        <description>RC Compare Effect on TIOBx</description>
                        <bitOffset>26</bitOffset>
                        <bitWidth>2</bitWidth>
                        <writeConstraint>
                           <useEnumeratedValues>true</useEnumeratedValues>
                        </writeConstraint>
                        <enumeratedValues>
                           <name>BCPCSelect</name>
                           <enumeratedValue>
                              <name>NONE</name>
                              <description>NONE</description>
                              <value>0x0</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>SET</name>
                              <description>SET</description>
                              <value>0x1</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>CLEAR</name>
                              <description>CLEAR</description>
                              <value>0x2</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>TOGGLE</name>
                              <description>TOGGLE</description>
                              <value>0x3</value>
                           </enumeratedValue>
                        </enumeratedValues>
                     </field>
                     <field>
                        <name>BEEVT</name>
                        <description>External Event Effect on TIOBx</description>
                        <bitOffset>28</bitOffset>
                        <bitWidth>2</bitWidth>
                        <writeConstraint>
                           <useEnumeratedValues>true</useEnumeratedValues>
                        </writeConstraint>
                        <enumeratedValues>
                           <name>BEEVTSelect</name>
                           <enumeratedValue>
                              <name>NONE</name>
                              <description>NONE</description>
                              <value>0x0</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>SET</name>
                              <description>SET</description>
                              <value>0x1</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>CLEAR</name>
                              <description>CLEAR</description>
                              <value>0x2</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>TOGGLE</name>
                              <description>TOGGLE</description>
                              <value>0x3</value>
                           </enumeratedValue>
                        </enumeratedValues>
                     </field>
                     <field>
                        <name>BSWTRG</name>
                        <description>Software Trigger Effect on TIOBx</description>
                        <bitOffset>30</bitOffset>
                        <bitWidth>2</bitWidth>
                        <writeConstraint>
                           <useEnumeratedValues>true</useEnumeratedValues>
                        </writeConstraint>
                        <enumeratedValues>
                           <name>BSWTRGSelect</name>
                           <enumeratedValue>
                              <name>NONE</name>
                              <description>NONE</description>
                              <value>0x0</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>SET</name>
                              <description>SET</description>
                              <value>0x1</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>CLEAR</name>
                              <description>CLEAR</description>
                              <value>0x2</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>TOGGLE</name>
                              <description>TOGGLE</description>
                              <value>0x3</value>
                           </enumeratedValue>
                        </enumeratedValues>
                     </field>
                  </fields>
               </register>
